Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: The chain is the same as the standard toolchain, except for the last item: ``gcc-cross-canadian`` (or ``clang-cross-canadian``) is the final relocatable cross-compiler. When run on the :term:`SDKMACHINE`, this tool produces executable code that runs on the target device. Only one cross-canadian compiler is produced per architecture since they can be targeted at different processor optimizations using configurations passed to the compiler through the compile commands. This circumvents the need for multiple compilers and thus reduces the size of the toolchains.
it_it: La catena è identica alla toolchain standard, ad eccezione dell'ultimo elemento: ``gcc-cross-canadian`` (o ``clang-cross-canadian``) è il cross-compilatore rilocabile finale. Quando eseguito sulla :term:`SDKMACHINE`, questo strumento produce codice eseguibile che viene eseguito sul dispositivo target. Viene prodotto un solo compilatore cross-canadian per architettura, poiché è possibile ottimizzarli per diversi processori utilizzando le configurazioni passate al compilatore tramite i comandi di compilazione. Questo evita la necessità di più compilatori e riduce quindi le dimensioni delle toolchain.

source: The chain of events that occurs when the standard toolchain is bootstrapped::
it_it: La sequenza di eventi che si verifica durante l'avvio della toolchain standard è la seguente::

source: The checksum therefore needs to exclude :term:`WORKDIR`. The simplistic approach for excluding the work directory is to set :term:`WORKDIR` to some fixed value and create the checksum for the "run" script.
it_it: Il checksum deve quindi escludere :term:`WORKDIR`. L'approccio più semplice per escludere la directory di lavoro consiste nell'impostare :term:`WORKDIR` su un valore fisso e creare il checksum per lo script "run".

source: The code in the build system that supports incremental builds is complex. For techniques that help you work around issues related to shared state code, see the ":ref:`dev-manual/debugging:viewing metadata used to create the input signature of a shared state task`" and ":ref:`dev-manual/debugging:invalidating shared state to force a task to run`" sections both in the Yocto Project Development Tasks Manual.
it_it: Il codice del sistema di build che supporta le build incrementali è complesso. Per le tecniche che consentono di risolvere i problemi relativi al codice dello stato shared, consultare le sezioni ":ref:`dev-manual/debugging:viewing metadata used to create the input signature of a shared state task`" e ":ref:`dev-manual/debugging:invalidating shared state to force a task to run`" entrambe presenti nel Manuale di Sviluppo dei Task di Yocto Project.

source: The command deletes all the build data for the specified build_id. This command is useful for removing old and unused data from the database.
it_it: Il comando elimina tutti i dati del build_id specificato. Questo comando è utile per rimuovere i dati vecchi e inutilizzati dal database.

source: The command is a sanity check that returns page loading times in order to identify performance problems.
it_it: Questo comando esegue un controllo di base che restituisce i tempi di caricamento delle pagine per identificare eventuali problemi di prestazioni.

source: The command returns a list, which includes numeric identifications, of the builds that Toaster has recorded in the current database.
it_it: Il comando restituisce un elenco, comprensivo di identificativi numerici, delle build registrate da Toaster nel database corrente.

source: The compiled-in barebox environment can be extended by adding environment files to the ``BAREBOX_ENV_DIR``. The ``BAREBOX_FIRMWARE_DIR`` variable allows you to specify the firmware blob search directory, enabling loading of additional firmware like TF-A or OP-TEE.
it_it: L'ambiente barebox compilato può essere esteso aggiungendo file di ambiente a ``BAREBOX_ENV_DIR``. La variabile ``BAREBOX_FIRMWARE_DIR`` consente di specificare la directory di ricerca dei blob del firmware, abilitando il caricamento di firmware aggiuntivi come TF-A o OP-TEE.

source: The configurations handled by the :ref:`ref-tasks-configure` task are specific to configurations for the source code being built by the recipe.
it_it: Le configurazioni gestite dal task :ref:`ref-tasks-configure` sono specifiche per le configurazioni del codice sorgente compilato dalla ricetta.

source: The contents of ``libhello/Makefile`` are::
it_it: Il contenuto di ``libhello/Makefile`` è il seguente::

source: The contents of ``libhello/hellolib.c`` are::
it_it: Il contenuto di ``libhello/hellolib.c`` è il seguente::

source: The contents of ``libhello/hellolib.h`` are::
it_it: Il contenuto di ``libhello/hellolib.h`` è il seguente::

source: The contents of ``libhello_0.1.bb`` are::
it_it: Il contenuto di ``libhello_0.1.bb`` è il seguente::

source: The contents of ``sayhello/Makefile`` are:
it_it: Il contenuto di ``sayhello/Makefile`` è:

source: The contents of ``sayhello/sayhello.c`` are::
it_it: Il contenuto di ``sayhello/sayhello.c`` è il seguente::

source: The contents of ``sayhello_0.1.bb`` are::
it_it: Il contenuto di ``sayhello_0.1.bb`` è il seguente::

source: The contents of the append file are::
it_it: Il contenuto del file di append è il seguente::

source: The contents of this directory controls any distribution-specific configurations. For the Yocto Project, the ``defaultsetup.conf`` is the main file here. This directory includes the versions and the :term:`SRCDATE` definitions for applications that are configured here. An example of an alternative configuration might be ``poky-bleeding.conf``. Although this file mainly inherits its configuration from Poky.
it_it: Il contenuto di questa directory controlla le configurazioni specifiche della distribuzione. Per Yocto Project, il file principale è ``defaultsetup.conf``. Questa directory include le versioni e le definizioni di :term:`SRCDATE` per le applicazioni configurate qui. Un esempio di configurazione alternativa potrebbe essere ``poky-bleeding.conf``, sebbene questo file erediti principalmente la sua configurazione da Poky.

source: The core build tool, :term:`BitBake`, is an execution engine and will execute code both during builds and when parsing recipes. This is not a security issue, it is an essential part of its function and purpose.
it_it: Lo strumento di build principale, :term:`BitBake`, è un motore di esecuzione ed esegue codice sia durante la compilazione che durante l'analisi delle ricette. Questo non rappresenta un problema di sicurezza, bensì una parte essenziale della sua funzione e del suo scopo.

source: The coverage below details some of the most common ways you'll likely want to apply the tool; full documentation can be found either within the tool itself or in the manual pages at :manpage:`perf(1)`.
it_it: La descrizione seguente illustra alcuni dei metodi più comuni con cui probabilmente si vorrà vorrete utilizzare il tool; la documentazione completa è disponibile all'interno del tool stesso o nelle pagine del manuale :manpage:`perf(1)`.

source: The current Yocto Project policy regarding backporting is to consider bug fixes and security fixes only. Policy dictates that features are not backported to a stable release. This policy means generic recipe version upgrades are unlikely to be accepted for backporting. The exception to this policy occurs when there is a strong reason such as the fix happens to also be the preferred upstream approach.
it_it: L'attuale politica di Yocto Project in merito al backporting prevede di considerare solo le correzioni di bug e le patch di sicurezza. La politica stabilisce che le nuove funzionalità non vengono retroportate in una release stabile. Questa politica implica che gli aggiornamenti generici di versione delle ricette difficilmente verranno accettati per il backporting. L'eccezione a questa politica si verifica quando esiste una valida ragione, ad esempio quando la correzione è anche l'approccio preferito a monte [upstream].

source: The current configuration does not allow the ``root`` user to login. As this can be useful for development, you can enable the :ref:`ref-fragments-root-login-with-empty-password` fragment:
it_it: La configurazione attuale non consente all'utente ``root`` di effettuare l'accesso. Poiché può essere utile per lo sviluppo, è possibile abilitare il frammento :ref:`ref-fragments-root-login-with-empty-password`:

source: The currently supported :term:`LTS` releases are:
it_it: Le versioni :term:`LTS` attualmente supportate sono:

source: The default location of the :ref:`overview-manual/concepts:Hash Equivalence` database is this directory (when :term:`BB_HASHSERVE` is set to ``auto``). If you need to share the :ref:`overview-manual/concepts:Hash Equivalence` database, don't share this file and instead refer to the :doc:`/dev-manual/hashequivserver` document of the Yocto Project Development Tasks Manual to setup a Hash Equivalence server.
it_it: La posizione di default del database :ref:`overview-manual/concepts:Hash Equivalence` è questa directory (quando :term:`BB_HASHSERVE` è impostato su ``auto``). Se si deve condividere il database :ref:`overview-manual/concepts:Hash Equivalence`, non condividere questo file e fare invece riferimento al documento :doc:`/dev-manual/hashequivserver` del Manuale di Sviluppo dei Task di Yocto Project per configurare un server Hash Equivalence.

source: The default output of the ``oe-init-build-env`` script is from the ``conf-summary.txt`` and ``conf-notes.txt`` files, which are found in the ``meta/conf/templates/default`` directory of :term:`OpenEmbedded-Core (OE-Core)`. If you design a custom distribution, you can include your own versions of these configuration files where you can provide a brief summary and detailed usage notes, such as a list of the targets defined by your distribution. See the ":ref:`dev-manual/custom-template-configuration-directory:creating a custom template configuration directory`" section in the Yocto Project Development Tasks Manual for more information.
it_it: L'output di default dello script ``oe-init-build-env`` proviene dai file ``conf-summary.txt`` e ``conf-notes.txt``, che si trovano nella directory ``meta/conf/templates/default`` di :term:`OpenEmbedded-Core (OE-Core)`. Se si progetta una distribuzione personalizzata, è possibile includere versioni personalizzate di questi file di configurazione, in cui è possibile fornire un breve riepilogo e note dettagliate sull'utilizzo, come ad esempio un elenco dei target definiti dalla distribuzione. Per ulteriori informazioni, consultare la sezione ":ref:`dev-manual/custom-template-configuration-directory:creating a custom template configuration directory`" del Manuale delle attività di sviluppo del progetto Yocto. The default output of the ``oe-init-build-env`` script is from the ``conf-summary.txt`` e ``conf-notes.txt`` files, which are found in the ``meta/conf/templates/default`` directory of :term:`OpenEmbedded-Core (OE-Core)`. If you design a custom distribution, you can include your own versions of these configuration files where you can provide a brief summary and detailed usage notes, such as a list of the targets defined by your distribution. See the ":ref:`dev-manual/custom-template-configuration-directory:creating a custom template configuration directory`" section in the Manuale di Sviluppo dei Task di Yocto Project.

source: The default project distro and layers are added from ``orm/fixtures/poky.xml`` if poky is installed. If poky is not installed, they are added from ``orm/fixtures/oe-core.xml``.
it_it: La distribuzione e i layer di default del progetto vengono aggiunti dal file ``orm/fixtures/poky.xml`` se Poky è installato. Se Poky non è installato, vengono aggiunti dal file ``orm/fixtures/oe-core.xml``.

source: The default project settings are set from ``orm/fixtures/settings.xml``.
it_it: Le impostazioni di default del progetto vengono definite dal file ``orm/fixtures/settings.xml``.

source: The default value for :term:`BP` is ``${BPN}-${PV}`` where:
it_it: Il valore si default per :term:`BP` è ``${BPN}-${PV}`` dove:

source: The dependencies added by ``depchains`` are in the form of :term:`RRECOMMENDS`.
it_it: Le dipendenze aggiunte da ``depchains`` sono nella forma di :term:`RRECOMMENDS`.

source: The description of tasks so far assumes that BitBake needs to build everything and no available prebuilt objects exist. BitBake does support skipping tasks if prebuilt objects are available. These objects are usually made available in the form of a shared state (sstate) cache.
it_it: La descrizione dei task finora presentati presuppone che BitBake debba compilare tutto e che non siano disponibili oggetti precompilati. BitBake supporta la possibilità di saltare i task se sono disponibili oggetti precompilati. Questi oggetti vengono solitamente resi disponibili sotto forma di cache "shared state" (sstate).

source: The documentation can be downloaded in file formats to be read offline or on another device. The currently supported formats are linked below:
it_it: La documentazione può essere scaricata in diversi formati per essere letta offline o su un altro dispositivo. I formati attualmente supportati sono elencati di seguito:

source: The documentation for ftrace can be found in the kernel Documentation directory::
it_it: La documentazione di ftrace si trova nella directory Documentation del kernel::

source: The documentation for the trace event subsystem can also be found in the kernel Documentation directory::
it_it: Anche la documentazione del sottosistema di tracciamento degli eventi si trova nella directory Documentation del kernel::

source: The end result is a summary of all the events recorded in the trace::
it_it: Il risultato finale è un riepilogo di tutti gli eventi registrati nella traccia::

source: The entire image generation process is run under Pseudo. Running under Pseudo ensures that the files in the root filesystem have correct ownership.
it_it: L'intero processo di generazione dell'immagine viene eseguito in ambiente Pseudo. L'esecuzione in ambiente Pseudo garantisce che i file nel filesystem root abbiano i permessi corretti.

source: The exact types of binaries present are highly hardware-dependent. The :ref:`README <bsp-manual/bsp:readme file>` file should be present in the BSP Layer and it explains how to use the images with the target hardware. Additionally, the :ref:`README.sources <bsp-manual/bsp:readme.sources file>` file should be present to locate the sources used to build the images and provide information on the Metadata.
it_it: I tipi esatti di binari presenti dipendono fortemente dall'hardware. Il file :ref:`README <bsp-manual/bsp:readme file>` dovrebbe essere presente nel layer BSP e spiega come utilizzare le immagini con l'hardware target. Inoltre, il file :ref:`README.sources <bsp-manual/bsp:readme.sources file>` dovrebbe essere presente per individuare i sorgenti utilizzati per la creazione delle immagini e fornire informazioni sui metadati.

source: The examples in this paper assume you are using a native Linux system running a :ref:`supported version of Ubuntu Linux distribution<ref-manual/system-requirements:supported linux distributions>`. If the machine you want to use Yocto Project on to build an image (:term:`Build Host`) is not a native Linux system, you can still perform these steps by using an :wikipedia:`OCI container <Open_Container_Initiative>` (using `Docker <https://www.docker.com/>`__ or `Podman <https://podman.io/>`__).
it_it: Gli esempi in questo documento presuppongono l'uso di un sistema Linux nativo con una :ref:`versione supportata di una distribuzione Ubuntu Linux<ref-manual/system-requirements:supported linux distributions>`. Se la macchina su cui si desidera utilizzare Yocto Project per creare un'immagine (:term:`Build Host`) non è un sistema Linux nativo, è comunque possibile eseguire questi passaggi utilizzando un :wikipedia:`container OCI <Open_Container_Initiative>` (tramite `Docker <https://www.docker.com/>`__ o `Podman <https://podman.io/>`__).

source: The examples so far have focused on tracing a particular program or workload --- that is, every profiling run has specified the program to profile in the command-line e.g. ``perf record wget ...``.
it_it: Gli esempi finora presentati si sono concentrati sul tracciamento di un programma o di un carico di lavoro specifico: in altre parole, ogni esecuzione di profilazione ha specificato il programma da profilare nella riga di comando, ad esempio ``perf record wget ...``.

source: The extensible SDK does not use ``gcc-cross-canadian`` or ``clang-cross-canadian`` since this SDK ships a copy of the OpenEmbedded build system and the sysroot within it contains ``gcc-cross``.
it_it: L'SDK estensibile non utilizza ``gcc-cross-canadian`` o ``clang-cross-canadian`` poiché include una copia del sistema di build OpenEmbedded e la directory di sistema (sysroot) al suo interno contiene ``gcc-cross``.

source: The file name can be specified as argument. Optionally, it can also use the list of compiled files from the kernel :term:`SPDX` to ignore CVEs that are not affected because the files are not compiled.
it_it: Il nome del file può essere specificato come argomento. Facoltativamente, può anche utilizzare l'elenco dei file compilati dal kernel :term:`SPDX` per ignorare le CVE non interessate perché i file non sono stati compilati.

source: The files ``site.conf`` and :ref:`structure-build-conf-auto.conf` are not created by the environment initialization script. If you want the :ref:`structure-build-conf-auto.conf` file, you need to create it yourself. The :ref:`structure-build-conf-auto.conf` file is typically created by an autobuilder:
it_it: I file ``site.conf`` e :ref:`structure-build-conf-auto.conf` non vengono creati dallo script di inizializzazione dell'ambiente. Se si desidera il file :ref:`structure-build-conf-auto.conf`, lo si deve creare manualmente. Il file :ref:`structure-build-conf-auto.conf` viene in genere creato da un autobuilder:

source: The files listed above are used for various purposes --- some relate directly to the tracers themselves, others are used to set tracing options, and yet others actually contain the tracing output when a tracer is in effect. Some of the functions can be guessed from their names, others need explanation; in any case, we'll cover some of the files we see here below but for an explanation of the others, please see the ftrace documentation.
it_it: I file sopra elencati hanno diverse funzioni: alcuni sono direttamente correlati ai tracer stessi, altri vengono utilizzati per impostare le opzioni di tracciamento e altri ancora contengono l'output di tracciamento quando un tracer è attivo. Alcune funzioni possono essere intuite dal nome, altre necessitano di una spiegazione; in ogni caso, analizzeremo alcuni dei file qui di seguito, ma per una spiegazione degli altri, si prega di consultare la documentazione di ftrace.

source: The final section of this manual is a collection of real-world examples which we'll be continually updating as we solve more problems using the tools --- feel free to suggest additions to what you read here.
it_it: La sezione finale di questo manuale è una raccolta di esempi pratici che aggiorneremo costantemente man mano che risolveremo nuovi problemi utilizzando i tool: non esitate a suggerire ulteriori esempi.

source: The final stages of the :ref:`ref-tasks-rootfs` task handle post processing. Post processing includes creation of a manifest file and optimizations.
it_it: Le fasi finali del task :ref:`ref-tasks-rootfs` gestiscono il "post processing". Il post processing include la creazione di un file manifest e le ottimizzazioni.

source: The final task involved in image creation is the :ref:`do_image_complete <ref-tasks-image-complete>` task. This task completes the image by applying any image post processing as defined through the :term:`IMAGE_POSTPROCESS_COMMAND` variable. The variable specifies a list of functions to call once the build system has created the final image output files.
it_it: Il task coinvolto nella creazione dell'immagine è :ref:`do_image_complete <ref-tasks-image-complete>`. Questo task completa l'immagine applicando qualsiasi post-elaborazione definita tramite la variabile :term:`IMAGE_POSTPROCESS_COMMAND`. La variabile specifica un elenco di funzioni da chiamare una volta che il sistema di build ha creato i file di output dell'immagine finale.

source: The first stages of building a recipe are to fetch and unpack the source code:
it_it: Le prime fasi della creazione di una ricetta consistono nel recuperare [fetch] e spacchettare il codice sorgente:

source: The first thing to do is to install Git packages. Here is an example on Debian and Ubuntu::
it_it: La prima cosa da fare è installare i pacchetti Git. Ecco un esempio su Debian e Ubuntu::

source: The following commands run the tool to create a layer named ``meta-mylayer``:
it_it: I seguenti comandi eseguono il tool per creare un layer denominato ``meta-mylayer``:

source: The following commands show how to start a Toaster environment without starting its web server, perform BitBake operations, and then shut down the Toaster environment. Once the build is complete, you can close the Toaster environment. Before closing the environment, however, you should allow a few minutes to ensure the complete transfer of its BitBake build statistics to the Toaster database. If you have a separate Toaster web server instance running, you can watch this command-line build's progress and examine the results as soon as they are posted::
it_it: I seguenti comandi mostrano come avviare un ambiente Toaster senza avviare il relativo server web, eseguire operazioni con BitBake e quindi arrestare l'ambiente Toaster. Una volta completata la build, è possibile chiudere l'ambiente Toaster. Prima di chiuderlo, tuttavia, è consigliabile attendere qualche minuto per garantire il trasferimento completo delle statistiche di build di BitBake al database di Toaster. Se si dispone di un'istanza separata del server web di Toaster in esecuzione, è possibile monitorare l'avanzamento di questa build da riga di comando ed esaminare i risultati non appena vengono pubblicati::

source: The following defines the default layers for each release:
it_it: Quanto segue definisce i layer di default per ciascuna release:

source: The following defines the releases when you create a new project:
it_it: Quanto segue definisce le release quando si crea un nuovo progetto:

source: The following defines which version of BitBake is used for the following release selection:
it_it: Quanto segue definisce la versione di BitBake utilizzata per la successiva selezione della release:

source: The following diagram represents the high-level workflow of a build. The remainder of this section expands on the fundamental input, output, process, and metadata logical blocks that make up the workflow.
it_it: Il diagramma seguente rappresenta il flusso di lavoro di alto livello di una build. Il resto di questa sezione approfondisce i blocchi logici fondamentali di input, output, processo e metadati che costituiscono il flusso di lavoro [workflow].

source: The following diagram shows the sequences of tasks that BitBake executes to accomplish that.
it_it: Il diagramma seguente mostra la sequenza di operazioni che BitBake esegue per raggiungere questo obiettivo.

source: The following distribution versions are still tested, even though the organizations publishing them no longer make updates publicly available:
it_it: Le seguenti versioni di distribuzione sono ancora testate, anche se le organizzazioni che le pubblicano non rendono più disponibili gli aggiornamenti pubblicamente:
